import fetch from 'node-fetch';
const handler = async (m, {conn, usedPrefix, usedPrefix: _p, __dirname, text, isPrems}) => {
  if (usedPrefix == 'a' || usedPrefix == 'A') return;
  try {
    const pp = imagen4;
    // let vn = './media/menu.mp3'
    const img = './Menu2.jpg';
    const d = new Date(new Date + 3600000);
    const locale = 'es-ES';
    const week = d.toLocaleDateString(locale, {weekday: 'long'});
    const date = d.toLocaleDateString(locale, {day: '2-digit', month: '2-digit', year: 'numeric'});
    const _uptime = process.uptime() * 1000;
    const uptime = clockString(_uptime);
    const user = global.db.data.users[m.sender];
    const {money, joincount} = global.db.data.users[m.sender];
    const {exp, limit, level, role} = global.db.data.users[m.sender];
    const rtotalreg = Object.values(global.db.data.users).filter((user) => user.registered == true).length;
    const rtotal = Object.entries(global.db.data.users).length || '0'
    const more = String.fromCharCode(8206);
    const readMore = more.repeat(850);
    const taguser = '@' + m.sender.split('@s.whatsapp.net')[0];
    const doc = ['pdf', 'zip', 'vnd.openxmlformats-officedocument.presentationml.presentation', 'vnd.openxmlformats-officedocument.spreadsheetml.sheet', 'vnd.openxmlformats-officedocument.wordprocessingml.document'];
    const document = doc[Math.floor(Math.random() * doc.length)];
    const str = `┏━━━━•☠️ *TIZI - BOT* ☠️•━━━━━━┓
┃┊•☠️ ¡ʜᴏʟᴀ!  @${m.sender.split`@`[0]}
┃╰─────────☠️────────╯
┃┊•☠️ ᴄʀᴇᴀᴅᴏʀ ᴏғᴄ
┃┊•☠️ wa.me/5493536568522
┃┊•☠️ ᴠᴇʀsɪᴏɴ ᴅᴇʟ ʙᴏᴛ: 1.0.0 (beta)
┃┊•☠️ғᴇᴄʜᴀ: ${date}
┃┊•☠️ɴɪᴠᴇʟ: ${level}
┃┊•☠️ᴇxᴘ: ${exp}
┃┊•☠️ʀᴀɴɢᴏ: ${role}
┃┊•☠️ᴅɪᴀᴍᴀɴᴛᴇs: ${limit}
┃┊•☠️ᴛɪᴢɪᴄᴏɪɴs: ${money}
┃┊•☠️ᴛᴏᴋᴇɴs: ${joincount}
┃┊•☠️ᴛɪᴇᴍᴘᴏ ᴀᴄᴛ: ${uptime}                                         
┗━━━━━━━━•◦ 🤖 ◦•━━━━━━━━┛
 
┏━━━━━━━━━━━━━━━━━━━━━┓
┃「 ✔️ 𝗢𝗡/𝗢𝗙𝗙 ❌ 」
┃╭───────⧟⭑⧟───────•
┃┊✔️.ᴇɴᴀʙʟᴇ
┃┊❌.ᴅɪsᴀʙʟᴇ
┃╰───────⧟⭑⧟───────•
┗━━━━━━━━━━━━━━━━━━━━━┛


┏━━━━━━━━━━━━━━━━━━━━━┓
┃「👹 ! 𝗚𝗥𝗨𝗣𝗢𝗦 !👹 」
┃╭───────⧟⭑⧟───────•
┃┊👹.ᴍᴇɴᴜғғ
┃┊👹.ᴄᴏᴍᴀɴᴅᴏsғғ
┃┊👹.ʙᴀɴ
┃┊👹.ɢʀᴜᴘᴏ
┃┊👹.ᴘʀᴏᴍᴏᴛᴇ
┃┊👹.ᴅᴇᴍᴏᴛᴇ
┃┊👹.ʟɪɴᴋ
┃┊👹.ᴛᴏᴅᴏs
┃┊👹.sᴇᴛᴡᴇʟᴄᴏᴍᴇ 
┃┊👹.sᴇᴛʙʏᴇ 
┃┊👹.ɴᴏᴛɪғʏ 
┃┊👹.ғᴀɴᴛᴀsᴍᴀ (ᴛɪᴢɪs) 
┃┊👹.ᴋɪᴄᴋғᴀɴᴛᴀsᴍᴀ
┃╰───────⧟⭑⧟───────•
┗━━━━━━━━━━━━━━━━━━━━━┛
 

┏━━━━━━━━━━━━━━━━━━━━━┓
┃「 👻 𝗙𝗥𝗘𝗘 𝗙𝗜𝗥𝗘 👻 」
┃╭───────⧟⭑⧟───────•
┃┊👻.ᴍᴇɴᴜ ғғ
┃┊👻.ʙᴇʀᴍᴜᴅᴀ
┃┊👻.ᴋᴀʟᴀʜᴀʀɪ
┃┊👻.ᴀʟᴘᴇs
┃┊👻.ᴘᴜʀɢᴀᴛᴏʀɪᴏ
┃┊👻.ɴᴇxᴛᴇʀʀᴀ
┃┊👻.ᴀɢᴇɴᴅᴀsᴇᴍᴀɴᴀʟ
┃╰───────⧟⭑⧟───────•
┗━━━━━━━━━━━━━━━━━━━━━┛
┃「 🧝🏼‍♀️𝗟𝗧𝗔𝗙🧝🏼‍♀️ 」
┃╭───────⧟⭑⧟───────•
┃┊🧝🏼‍♀️.ғᴇᴍɪɴғɪɴɪᴛᴏ 14
┃┊🧝🏼‍♀️.ғᴇᴍɪɴғɪɴɪᴛᴏ 16
┃┊🧝🏼‍♀️.ғᴇᴍɪɴғɪɴɪᴛᴏ 18
┃┊🧝🏼‍♀️.ғᴇᴍɪɴғɪɴɪᴛᴏ 20
┃┊🧝🏼‍♀️.ғᴇɴɪɴғɪɴɪᴛᴏ 22
┃┊🧝🏼‍♀️.ғᴇᴍɪɴғɪɴɪᴛᴏ 00
┃┊🧝🏼‍♀️.ғᴇᴍɪɴғɪɴɪᴛᴏᴠs
┃┊🧝🏼‍♀️.ғᴇᴍᴠɪᴠɪᴏ 14
┃┊🧝🏼‍♀️.ғᴇᴍᴠɪᴠɪᴅᴏ 16
┃┊🧝🏼‍♀️.ғᴇᴍᴠɪᴠɪᴅᴏ 18
┃┊🧝🏼‍♀️.ғᴇᴍᴠɪᴠɪᴅᴏ 20
┃┊🧝🏼‍♀️.ғᴇᴍᴠɪᴠɪᴅᴏ 22
┃┊🧝🏼‍♀️.ғᴇᴍᴠɪᴠɪᴅᴏ 00
┃┊🧝🏼‍♀️.ғᴇᴍᴠɪᴠɪᴅᴏᴠs
┃┊🧝🏼‍♀️.ғᴇᴍ8ᴠs8
┃┊🧝🏼‍♀️.ғᴇᴍ12ᴠs12
┃┊🧝🏼‍♀️.ғᴇᴍ16ᴠs16
┃┊🧝🏼‍♀️.ғᴇᴍɪɴᴛᴇʀɴᴀ 4
┃┊🧝🏼‍♀️.ғᴇᴍɪɴᴛᴇʀɴᴀ 6
┃╰───────⧟⭑⧟───────•
┗━━━━━━━━━━━━━━━━━━━━━┛


┏━━━━━━━━━━━━━━━━━━━━━┓
┃「 ☮️𝙇𝙄𝙎𝙏𝘼𝙎 𝙈𝘼𝙎𝘾☮️ 」
┃╭───────⧟⭑⧟───────•
┃│🧝🏼.ᴍᴀsᴄɪɴғɪɴɪᴛᴏ 14
┃│🧝🏼.ᴍᴀsᴄɪɴғɪɴɪᴛᴏ 16
┃│🧝🏼.ᴍᴀsᴄɪɴғɪɴɪᴛᴏ 18
┃│☮️.ᴍᴀsᴄɪɴғɪɴɪᴛᴏ 20
┃│☮️.ᴍᴀsᴄɪɴғɪɴɪᴛᴏ 22
┃│☮️.ᴍᴀsᴄɪɴғɪɴɪᴛᴏ 00
┃│☮️.ᴍᴀsᴄɪɴғɪɴɪᴛᴏᴠs
┃│☮️.ᴍᴀsᴄᴠɪᴠɪᴅᴏ 14
┃│☮️.ᴍᴀsᴄᴠɪᴠɪᴅᴏ 16
┃│☮️.ᴍᴀsᴄᴠɪᴠɪᴅᴏ 18
┃│☮️.ᴍᴀsᴄᴠɪᴠɪᴅᴏ 20
┃│☮️.ᴍᴀsᴄᴠɪᴠɪᴅᴏ 22
┃│☮️.ᴍᴀsᴄᴠɪᴠɪᴅᴏ 00
┃│☮️.ᴍᴀsᴄᴠɪᴠɪᴅᴏᴠs
┃│☮️.ᴍᴀsᴄ8ᴠs8
┃│☮️.ᴍᴀsᴄ12ᴠs12
┃│☮️.ᴍᴀsᴄ16ᴠs16
┃│☮️.ᴍᴀsᴄɪɴᴛᴇʀɴᴀ 4
┃│☮️.ᴍᴀsᴄɪɴᴛᴇʀɴᴀ 6
┃╰───────⧟⭑⧟───────•
┗━━━━━━━━━━━━━━━━━━━━━┛


┏━━━━━━━━━━━━━━━━━━━━━┓
┃「 👑 𝗕𝗨𝗦𝗖𝗔𝗥 𝗩𝗦 👑 」
┃╭───────⧟⭑⧟───────•
┃┊👑.ʙᴜsᴄᴀʀᴠsᴍᴀsᴄ
┃┊👑.ʙsᴍᴀsᴄ
┃┊👑.ʙᴜsᴄᴀʀᴠsғᴇᴍ
┃┊👑.ʙsғᴇᴍ
┃┊👑.ʙᴜsᴄᴀʀᴠsᴍɪxᴛᴏ
┃┊👑.ʙsᴍɪxᴛᴏ
┃╰───────⧟⭑⧟───────•
┗━━━━━━━━━━━━━━━━━━━━━┛


┏━━━━━━━━━━━━━━━━━━━━━┓
┃「 👾 𝗟𝗜𝗡𝗞𝗦/𝗔𝗣𝗞𝗦 👾 」
┃╭───────⧟⭑⧟───────•
┃│👾sᴘᴀᴍᴀᴘᴋ / ᴡʜᴀᴛsᴀᴘᴘ
┃│👾.sᴘᴀᴍᴄᴏᴍᴜ / ᴄᴏᴍᴜ́ɴ
┃│👾.sᴘᴀᴍ 2
┃│👾.ʀᴄᴜʀsᴏsᴅᴢɴ
┃│👾.ᴅʀɪᴠᴇs ᴅᴢɴ
┃│👾.ᴅɴᴢ
┃│👾.ᴀᴘᴋᴇᴅɪᴛs
┃│👾.ᴅʀɪᴠᴇᴇᴅɪᴛs
┃╰───────⧟⭑⧟───────•
┗━━━━━━━━━━━━━━━━━━━━━┛


┏━━━━━━━━━━━━━━━━━━━━━┓
┃「 🐼 𝗦𝗧𝗜𝗖𝗞𝗘𝗥𝗦 🐼 」
┃╭───────⧟⭑⧟───────•
┃│🐼.sᴛɪᴄᴋᴇʀ  | s ɪᴍᴀɢᴇɴ ᴏ ᴠɪᴅᴇᴏ
┃│🐼.sᴛɪᴄᴋᴇʀ | s ᴜʀʟ ᴅᴇ ᴛɪᴘᴏ ᴊᴘɢ
┃│🐼.ᴇᴍᴏᴊɪᴍɪx 😺+😆
┃│🐼.ǫᴄ
┃│🐼.sᴄɪʀᴄʟᴇ | ᴄɪʀᴄᴜʟᴏ ɪᴍᴀɢᴇɴ
┃│🐼.sᴇᴍᴏᴊɪ | ᴇᴍᴏᴊɪ ᴛɪᴘᴏ ᴇᴍᴏᴊɪ
┃│🐼.ᴀᴛᴛᴘ ᴛᴇxᴛᴏ
┃│🐼.ᴀᴛᴛᴘ2 ᴛᴇxᴛᴏ
┃│🐼.ᴛᴛᴘ ᴛᴇxᴛᴏ
┃│🐼.ᴛᴛᴘ2 ᴛᴇxᴛᴏ
┃│🐼.ᴛᴛᴘ3 ᴛᴇxᴛᴏ
┃│🐼.ᴛᴛᴘ4 ᴛᴇxᴛᴏ
┃│🐼.ᴛᴛᴘ5 ᴛᴇxᴛᴏ
┃│🐼.ᴛᴛᴘ6 ᴛᴇxᴛᴏ
┃│🐼.ᴅᴀᴅᴏ
┃│🐼.sᴛɪᴄᴋᴇʀᴍᴀᴋᴇʀ ʀᴇsᴘᴏɴᴅᴇʀ | ɪᴍᴀɢᴇɴ
┃│🐼sᴛɪᴄᴋᴇʀғɪʟᴛʀᴇʀ ʀᴇsᴘᴏɴᴅᴇʀ | ɪᴍᴀɢᴇɴ
┃│🐼.ᴄs : ᴄs2
┃╰───────⧟⭑⧟───────•
┗━━━━━━━━━━━━━━━━━━━━━┛


┏━━━━━━━━━━━━━━━━━━━━━┓
┃「 🎮𝗝𝗨𝗘𝗚𝗢𝗦🎮 」
┃╭───────⧟⭑⧟───────•
┃│🎮.ᴍᴀᴛᴇs
┃│🎮.ᴘᴘᴛᴛ
┃│🎮.ᴘʀᴏsᴛɪᴛᴜᴛᴏ <@ᴛᴀɢ>
┃│🎮.ᴘʀᴏsᴛɪᴛᴜᴛᴀ <@ᴛᴀɢ>
┃│🎮.ɢᴀʏ2 <@ᴛᴀɢ>
┃│🎮.ʟᴇsʙɪᴀɴᴀ  <@ᴛᴀɢ>
┃│🎮ᴘᴀᴊᴇʀᴏ <@ᴛᴀɢ>
┃│🎮.ᴘᴀᴊᴇʀᴀ <@ᴛᴀɢ>
┃│🎮.ᴘᴜᴛᴏ <@ᴛᴀɢ>
┃│🎮.ᴘᴜᴛᴀ <@ᴛᴀɢ>
┃│🎮.ᴍᴀɴᴄᴏ <@ᴛᴀɢ>
┃│🎮.ᴍᴀɴᴄᴀ <@ᴛᴀɢ>
┃│🎮.ʀᴀᴛᴀ <@ᴛᴀɢ>
┃│🎮.ɴᴇɢʀᴏ <@ᴛᴀɢ>
┃│🎮.ɴᴇɢʀᴀ <@ᴛᴀɢ>
┃│🎮ғᴇᴀ <@ᴛᴀɢ>
┃│🎮ғᴇᴏ <@ᴛᴀɢ>
┃│🎮.sɪɴᴘᴏᴛᴏ <@ᴛᴀɢ>
┃│🎮.sɪɴᴛᴇᴛᴀs <@ᴛᴀɢ>
┃│🎮.sɪɴᴘɪᴛᴏ <@ᴛᴀɢ>
┃│🎮.ᴀᴅᴏᴘᴛᴀᴅᴀ <@ᴛᴀɢ>
┃│🎮.ᴀᴅᴏᴘᴛᴀᴅᴏ <@ᴛᴀɢ>
┃│🎮.ʟᴏᴠᴇ
┃│🎮.ʟᴏs10
┃│🎮.sᴜɪᴛᴘᴠᴘ
┃│🎮.sʟᴏᴛ
┃│🎮.sɪᴍsɪᴍɪ
┃│🎮.ɢᴇᴍɪɴɪs
┃│🎮.ᴘʀᴇɢᴜɴᴛᴀ
┃│🎮.ᴄᴜᴀɴᴅᴏ
┃│🎮.sʜɪᴘ5
┃│🎮.ᴀʙʀᴀᴢᴏ
┃│🎮.sʜɪᴘ2
┃│🎮.ғᴏʀᴍᴀʀᴘᴀʀᴇᴊᴀ
┃│🎮.ᴠᴇʀᴅᴀᴅ
┃│🎮.ʀᴇᴛᴏ
┃│🎮.ᴄᴀɴᴄɪᴏɴ
┃│🎮.ᴘɪsᴛᴀ
┃│🎮.ʀᴜʟᴇᴛᴀ
┃│🎮.ᴢᴏᴅɪᴀᴄ
┃│🎮.ᴏᴅɪᴏ
┃│🎮.sʜɪᴘ
┃│🎮.sᴏʀᴛᴇᴏ
┃│🎮.ᴍɪɴᴏᴠɪᴀ
┃│🎮.ᴍɪɴᴏᴠɪᴀ
┃│🎮.ᴋᴄʜᴇʀᴀ
┃│🎮.ᴋᴄʜᴇʀᴏ
┃╰───────⧟⭑⧟───────•
┗━━━━━━━━━━━━━━━━━━━━━┛


┏━━━━━━━━━━━━━━━━━━━━━┓
┃「 🎭 𝗜𝗠𝗔𝗚𝗘𝗡𝗘𝗦 🎭 」
┃╭───────⧟⭑⧟───────•
┃│🖍️.ɢᴏᴋᴜ
┃│🖍️.ᴠᴇɢᴇᴛᴀ
┃│🖍️.ʟᴏʀᴀ
┃│🖍️.ᴄʀ7
┃│🖍️.sᴘɪᴅᴇʀᴍᴀɴ
┃│🖍️.ʙᴀᴛᴍᴀɴ
┃│🖍️.ʜᴇʟʟᴏᴋɪᴛʏ
┃│🖍️.ᴄʜᴀʀᴍᴀɴᴅᴇʀ
┃╰───────⧟⭑⧟───────•
┗━━━━━━━━━━━━━━━━━━━━━┛


┏━━━━━━━━━━━━━━━━━━━━━┓
┃「 🈴 𝗗𝗘𝗦𝗖𝗔𝗥𝗚𝗔𝗦 🈴 」
┃╭───────⧟⭑⧟───────•
┃│🈴.ᴘʟᴀʏ
┃│🈴.ᴘʟᴀʏ.1
┃│🈴.ᴘʟᴀʏ 2.2
┃│🈴.ʏᴛᴠ .2
┃│🈴.ʏᴛᴠ .2
┃│🈴.ᴘʟᴀʏʟɪsᴛ
┃│🈴.sᴘᴏᴛɪғʏ
┃│🈴.sᴘᴏᴛɪғʏᴅʟ
┃│🈴.ᴛɪᴋᴛᴏᴋ
┃│🈴.ɪsᴛᴀɢʀᴀᴍ
┃│🈴.ᴍᴇᴅɪᴀғɪʀᴇ
┃│🈴.ɢᴅʀɪᴠᴇ
┃│🈴.ᴛᴡɪᴛᴛᴇʀ
┃│🈴.ʏᴛᴀ
┃│🈴.ʏᴛᴠ
┃│🈴.ɪᴍᴀɢᴇɴ
┃│🈴.ɪᴀɪᴍᴀɢᴇɴ
┃│🈴.ᴘɪɴᴛᴇʀᴇsᴛ
┃│🈴.ʟɢᴛᴏʀʏ
┃╰───────⧟⭑⧟───────•
┗━━━━━━━━━━━━━━━━━━━━━┛


┏━━━━━━━━━━━━━━━━━━━━━┓
┃「 📍𝗖𝗢𝗡𝗩𝗘𝗥𝗧𝗜𝗗𝗢𝗥𝗘𝗦📍 」
┃╭───────⧟⭑⧟───────•
┃│📍.ᴛᴏɪᴍᴘ
┃│📍.ᴛᴏɪᴍᴘ 3
┃│📍.ᴛᴏᴘᴛᴛ
┃│📍.ᴛᴏᴠɪᴅᴇᴏ
┃│📍.ᴛᴛs
┃╰───────⧟⭑⧟───────•
┗━━━━━━━━━━━━━━━━━━━━━┛


┏━━━━━━━━━━━━━━━━━━━━━┓
┃「 ♓ 𝗘𝗙𝗘𝗖𝗧𝗢𝗦/𝗟𝗢𝗚𝗢𝗦 ♓ 」
┃╭───────⧟⭑⧟───────•
┃│♓.ᴍᴇɴsᴀᴊᴇғᴀʟsᴏ
┃│♓.ʟᴏɢᴏs
┃│♓.ʟᴏɢᴏᴄᴏʀᴀᴢᴏɴ
┃│♓.ʏᴛᴄᴏᴍᴍᴇɴᴛ
┃│♓.ʜᴏʀɴʏᴄᴀʀᴅ
┃│♓.ʟᴛssᴏsᴛᴜᴘɪᴅ
┃│♓.ᴘɪxᴇʟᴀʀ
┃╰───────⧟⭑⧟───────•
┗━━━━━━━━━━━━━━━━━━━━━┛


┏━━━━━━━━━━━━━━━━━━━━━┓
┃「 💌 𝗙𝗥𝗔𝗦𝗘𝗦 💌 」
┃╭───────⧟⭑⧟───────•
┃│🌹.ᴘɪʀᴏᴘᴏ
┃│🌹.ᴄᴏɴsᴇᴊᴏs
┃│🌹.ғʀᴀsᴇʀᴏᴍᴀɴᴛɪᴄᴀ
┃╰───────⧟⭑⧟───────•
┗━━━━━━━━━━━━━━━━━━━━━┛


┏━━━━━━━━━━━━━━━━━━━━━┓
┃「 ✨ 𝗕𝗨𝗦𝗖𝗔𝗗𝗢𝗥𝗘𝗦 ✨ 」
┃╭───────⧟⭑⧟───────•
┃│🔍.xɴxxsᴇᴀʀᴄʜ
┃│🔍.ɢᴏᴏɢʟᴇ
┃│🔍.ʟᴇᴛʀᴀ
┃│🔍.ᴡɪᴋɪᴘᴇᴅɪᴀ
┃│🔍.ʏᴛsᴇᴀʀᴄʜ
┃│🔍.ᴘʟᴀʏsᴛᴏʀᴇ
┃│🔍.ᴍᴇʀᴄᴀᴅᴏʟɪʙʀᴇ
┃│🔍.ᴘᴏʀɴʜᴜʙsᴇᴀʀᴄʜ
┃╰───────⧟⭑⧟───────•
┗━━━━━━━━━━━━━━━━━━━━━┛


┏━━━━━━━━━━━━━━━━━━━━━┓
┃「 ☀️ 𝗛𝗘𝗥𝗥𝗔𝗠𝗜𝗘𝗡𝗧𝗔𝗦 ☀️ 」
┃╭───────⧟⭑⧟───────•
┃│☀️.ᴄʟɪᴍᴀ
┃│☀️.ᴀғᴋ
┃│☀️.ᴏᴄʀ
┃│☀️.ᴄᴀʟᴄ
┃│☀️.ᴅᴇʟ
┃│☀️.ᴡʜᴀᴛᴍᴜsɪᴄ
┃│☀️.ǫʀᴄᴏᴅᴇ
┃│☀️.ᴛʀᴀᴅᴜᴄɪʀ
┃╰───────⧟⭑⧟───────•
┗━━━━━━━━━━━━━━━━━━━━━┛


┏━━━━━━━━━━━━━━━━━━━━━┓
┃「 ⭐ 𝗘𝗖𝗢𝗡𝗢𝗠𝗜𝗔𝗦 ⭐ 」
┃╭───────⧟⭑⧟───────•
┃│⭐.ᴠᴇʀɪғɪᴄᴀʀ
┃│⭐.ᴜɴʀᴇɢ
┃│⭐.ᴍɪɴᴀʀ
┃│⭐.ʙᴜʏ
┃│⭐.ᴡᴏʀᴋ
┃│⭐.ᴍᴇɴᴅɪɢᴀʀ
┃│⭐.ᴛʀᴀɴsғᴇʀ
┃╰───────⧟⭑⧟───────•
┗━━━━━━━━━━━━━━━━━━━━━┛


┏━━━━━━━━━━━━━━━━━━━━━┓
┃「 🍂 𝗢𝗪𝗡𝗘𝗥𝗦 🍂 」
┃╭───────⧟⭑⧟───────•
┃│🍂.ᴊᴏɪɴ ᴇɴʟᴀᴄᴇ
┃│🍂.ᴜɴᴇᴛᴇ ᴇɴʟᴀᴄᴇ
┃│🍂.ᴅᴀʀᴅɪᴀᴍᴀɴᴛᴇs ᴄᴀɴᴛɪᴅᴀᴅ
┃│🍂.ᴅᴀʀxᴘ ᴄᴀɴᴛɪᴅᴀᴅ
┃│🍂.ᴅᴀʀᴛɪᴢɪᴄᴏɪɴs ᴄᴀɴᴛɪᴅᴀᴅ
┃│🍂.ᴀᴅᴅᴘʀᴇᴍ @ᴛᴀɢ ᴄᴀɴᴛɪᴅᴀᴅ
┃│🍂.ᴀᴅᴅᴘʀᴇᴍ 2 @ᴛᴀɢ ᴄᴀɴᴛɪᴅᴀᴅ
┃│🍂.ᴀᴅᴅᴘʀᴇᴍ 3 @ᴛᴀɢ ᴄᴀɴᴛɪᴅᴀᴅ
┃│🍂.ᴀᴅᴅᴘʀᴇᴍ 4 @ᴛᴀɢ ᴄᴀɴᴛɪᴅᴀᴅ
┃│🍂.ɪᴅɪᴏᴍᴀ | ʟᴇɴɢᴜᴀᴊᴇ
┃│🍂.ᴄᴀᴊᴀғᴜᴇʀᴛᴇ
┃│🍂.ᴄᴏᴍᴜɴɪᴄᴀʀ | ᴛᴇxᴛᴏ
┃│🍂.ʙʀᴏᴀᴅᴄᴀsᴛᴄʜᴀᴛ | ᴛᴇxᴛᴏʙʙ
┃│🍂.ᴄᴏᴍᴜɴɪᴄᴀʀᴘᴠ | ᴛᴇxᴛᴏ
┃│🍂.ʙʀᴏᴀᴅᴄᴀsᴛɢᴄ | ᴛᴇxᴛᴏ
┃│🍂.ᴄᴏᴍᴜɴɪᴄᴀʀɢʀᴜᴘᴏs | ᴛᴇxᴛᴏ
┃│🍂.ʙᴏʀʀᴀʀᴛᴍᴘ     
┃│🍂.ᴅᴇʟᴇxᴘ @ᴛᴀɢ
┃│🍂ᴅᴇʟᴏᴘᴛɪᴍᴜsᴄᴏɪɴs @ᴛᴀɢ
┃│🍂.ᴅᴇʟᴅɪᴀᴍᴀɴᴛᴇ @ᴛᴀɢ
┃│🍂.ʀᴇɪɴɪᴄɪᴀʀ | ʀᴇsᴛᴀʀᴛ
┃│🍂.ᴀᴄᴛᴜᴀʟɪᴢᴀʀ | ᴜᴘᴅᴀᴛᴇ
┃│🍂.ᴀᴅᴅᴘʀᴇᴍ | +ᴘʀᴇᴍ @ᴛᴀɢ
┃│🍂.ᴅᴇʟᴘʀᴇᴍ | -ᴘʀᴇᴍ @ᴛᴀɢ
┃│🍂.ʟɪsᴛᴀᴘʀᴇᴍɪᴜᴍ | ʟɪsᴛᴘʀᴇᴍ
┃│🍂.ᴀɴ̃ᴀᴅɪʀᴅɪᴀᴍᴀɴᴛᴇs @ᴛᴀɢ ᴄᴀɴᴛɪᴅᴀᴅ
┃│🍂.ᴀɴ̃ᴀᴅɪʀxᴘ @ᴛᴀɢ ᴄᴀɴᴛɪᴅᴀᴅ
┃│🍂.ᴀɴ̃ᴀᴅɪʀᴛɪᴢɪᴄᴏɪɴs @ᴛᴀɢ ᴄᴀɴᴛɪᴅᴀᴅ
┃╰───────⧟⭑⧟───────•
┗━━━━━━━━━━━━━━━━━━━━━┛`.trim();
    if (m.isGroup) {
      // await conn.sendFile(m.chat, vn, 'menu.mp3', null, m, true, { type: 'audioMessage', ptt: true})
      const fkontak2 = {'key': {'participants': '0@s.whatsapp.net', 'remoteJid': 'status@broadcast', 'fromMe': false, 'id': 'Halo'}, 'message': {'contactMessage': {'vcard': `BEGIN:VCARD\nVERSION:3.0\nN:Sy;Bot;;;\nFN:y\nitem1.TEL;waid=${m.sender.split('@')[0]}:${m.sender.split('@')[0]}\nitem1.X-ABLabel:Ponsel\nEND:VCARD`}}, 'participant': '0@s.whatsapp.net'};
      conn.sendMessage(m.chat, {image: pp, caption: str.trim(), mentions: [...str.matchAll(/@([0-9]{5,16}|0)/g)].map((v) => v[1] + '@s.whatsapp.net')}, {quoted: m});
    } else {
      // await conn.sendFile(m.chat, vn, 'menu.mp3', null, m, true, { type: 'audioMessage', ptt: true})
      const fkontak2 = {'key': {'participants': '0@s.whatsapp.net', 'remoteJid': 'status@broadcast', 'fromMe': false, 'id': 'Halo'}, 'message': {'contactMessage': {'vcard': `BEGIN:VCARD\nVERSION:3.0\nN:Sy;Bot;;;\nFN:y\nitem1.TEL;waid=${m.sender.split('@')[0]}:${m.sender.split('@')[0]}\nitem1.X-ABLabel:Ponsel\nEND:VCARD`}}, 'participant': '0@s.whatsapp.net'};
      conn.sendMessage(m.chat, {image: pp, caption: str.trim(), mentions: [...str.matchAll(/@([0-9]{5,16}|0)/g)].map((v) => v[1] + '@s.whatsapp.net')}, {quoted: fkontak2});
    }
  } catch {
    conn.reply(m.chat, '🧸 𝗘𝘀𝘁𝗲 𝗺𝗲𝗻𝘂́ 𝘁𝗶𝗲𝗻𝗲 𝘂𝗻 𝗲𝗿𝗿𝗼𝗿 𝗶𝗻𝘁𝗲𝗿𝗻𝗼, 𝗽𝗼𝗿 𝗹𝗼 𝗰𝘂𝗮𝗹 𝗻𝗼 𝗳𝘂𝗲 𝗽𝗼𝘀𝗶𝗯𝗹𝗲 𝗲𝗻𝘃𝗶𝗮𝗿𝗹𝗼. 𝗥𝗲𝗽𝗼𝗿𝘁𝗮 𝗲𝘀𝘁𝗲 𝗲𝗿𝗿𝗼𝗿 𝗮𝗹 𝗰𝗿𝗲𝗮𝗱𝗼𝗿 𝗼 𝗮𝗹 𝘀𝘁𝗮𝗳𝗳.', m);
  }
};
handler.command = /^(menu|menú|Menú|Menu|menuu)$/i;
handler.register = true
handler.exp = 50;
handler.fail = null;
export default handler;
function clockString(ms) {
  const h = isNaN(ms) ? '--' : Math.floor(ms / 3600000);
  const m = isNaN(ms) ? '--' : Math.floor(ms / 60000) % 60;
  const s = isNaN(ms) ? '--' : Math.floor(ms / 1000) % 60;
  return [h, m, s].map((v) => v.toString().padStart(2, 0)).join(':');
}
