const handler = async (m, {conn, usedPrefix}) => {
  const pp = imagen4;
  try {
  } catch (e) {
  } finally {
    const name = await conn.getName(m.sender);
    const taguser = '@' + m.sender.split('@s.whatsapp.net')[0];
    const str = `┏━━━━• ☠️ 𝗧𝗜𝗭𝗜 - 𝗕𝗢𝗧 ☠️ •━━━━┓
│ ┌──────────────────┐
│   •☠️ ¡ʜᴏʟᴀ! @user
│ └──────────────────┘
││•🫀 ᴄʀᴇᴀᴅᴏʀ ᴡᴀ.ᴍᴇ/+5493536568522
││•🫀ᴠᴇʀᴄɪᴏ̃ɴ ᴅᴇʟ ʙᴏᴛ| 1.0.0
││•🫀 ғᴇᴄʜᴀ| ${date} 
││•🫀  ɴɪᴠᴇʟ| ${level}
││•🫀 ᴇxᴘ| ${exp} 
││•🫀 ʀᴀɴɢᴏ|  ${role}  
││•🫀 ᴅɪᴀᴍᴀɴᴛᴇs| ${limit}
││•🫀ᴛɪᴢɪᴄᴏɪɴs| ${money}
││•🫀 ᴛᴏᴋᴇɴs| ${joincount}
││•🫀 ᴛɪᴇᴍᴘᴏ ᴀᴄᴛɪᴠᴏ| ${uptime}                                                                                                  
┗━━━━━━━━•◦ ☠️ •◦━━━━━━━┛

Aǫᴜɪ ᴘᴏᴅʀᴀs ɢᴜᴀʀᴅᴀʀ ᴍsᴊ Qᴜᴇ ǫᴜɪᴇʀᴀᴅ ᴠᴇʀ ᴍᴀs ᴛᴀʀᴅᴇ.
ʙʏ ᴍᴀxᴢ

 ┏━━━━━━━━━━━━━━━━━━━━┓
  *|* 𝗔𝗚𝗥𝗘𝗚𝗔𝗥 𝗔 𝗟𝗔 𝗟𝗜𝗦𝗧𝗔 🗳️                                
 ┗━━━━━━━━━━━━━━━━━━━━┛
 │•🗳️ ᴀɢʀᴇɢᴀʀᴍsɢ <Tᴇxᴛᴏ>
 │•🗳️ (ʀᴇsᴘᴏɴᴅᴇ ᴜɴ ᴛᴇxᴛᴏ)
 │•🗳️ ᴀɢʀᴇɢᴀʀᴠɴ <ᴛᴇxᴛᴏ>
 │•🗳️ (ʀᴇsᴘᴏɴᴅᴇ ᴀ ᴜɴᴀ ɴᴏᴛᴀ ᴅᴇ ᴠᴏᴢ)
 │•🗳️ ᴀɢʀᴇɢᴀʀᴠɪᴅᴇᴏ <ᴛᴇxᴛᴏ>
 │•🗳️(ʀᴇsᴘᴏɴᴅᴇ  ᴀ ᴜɴ ᴠɪᴅᴇᴏ
 │•🗳️ ᴀɢʀᴇɢᴀʀᴀᴜᴅɪᴏ <ᴛᴇxᴛᴏ>
 │•🗳️(ʀᴇsᴘᴏɴᴅᴇ ᴀ ᴜɴ ᴀᴜᴅɪᴏ
 │•🗳️ ᴀɢʀᴇɢᴀʀɪᴍɢ <ᴛᴇxᴛᴏ>
 │•🗳️(ʀᴇsᴘᴏɴᴅᴇ ᴜɴᴀ ɪᴍᴀɢᴇɴ)
 │•🗳️ ᴀɢʀᴇɢᴀʀsᴛɪᴄᴋᴇʀ <ᴛᴇxᴛᴏ
 │•🗳️(ʀᴇsᴘᴏɴᴅᴀ ᴀ ᴜɴ sᴛɪᴄᴋᴇʀ)
 ┗━━━━━━━━━━━━━━━━━━━━┛
 ┏━━━━━━━━━━━━━━━━━━━━┓
  *|* • 𝗟𝗜𝗦𝗧𝗔 𝗗𝗘 𝗖𝗢𝗠𝗔𝗡𝗗𝗢𝗦 🗳️                              
 ┗━━━━━━━━━━━━━━━━━━━━┛
 │• 🗳️ ʟɪsᴛᴀᴍsɢ
 │• 🗳️ ʟɪsᴛᴀᴠɴ
 │• 🗳️ʟɪsᴛᴀᴠɪᴅᴇᴏ
 │• 🗳️ ʟɪsᴛᴀᴀᴜᴅɪᴏ
 │• 🗳️ ʟɪsᴛᴀɪᴍɢ
 │• 🗳️ ʟɪsᴛᴀsᴛɪᴄᴋᴇʀ
 ┗━━━━━━━━━━━━━━━━━━━━┛
 ┏━━━━━━━━━━━━━━━━━━━━┓
  *|* 𝗩𝗘𝗥 𝗧𝗘𝗫𝗧𝗢𝗦 𝗢 𝗔𝗥𝗖𝗛𝗜𝗩𝗢𝗦🗳️                               
 ┗━━━━━━━━━━━━━━━━━━━━┛
 │•🗳️ ᴠᴇʀsᴍɢ
 │•🗳️ ᴠᴇʀᴠɴ
 │•🗳️ ᴠᴇʀᴠɪᴅᴇᴏ
 │•🗳️ ᴠᴇʀᴀᴜᴅɪᴏ
 │•🗳️ᴠᴇʀɪᴍɢ
 │•🗳️ ᴠᴇʀsᴛɪᴄᴋᴇʀ
 ┗━━━━━━━━━━━━━━━━━━━━┛
 ┏━━━━━━━━━━━━━━━━━━━━┓
  *|* •𝗘𝗟𝗜𝗠𝗜𝗡𝗔𝗥 🗳️                               
 ┗━━━━━━━━━━━━━━━━━━━━┛
  │•🗳️ ᴇʟɪᴍɪɴᴀʀᴍsɢ
  │•🗳️ ᴇʟɪᴍɪɴᴀʀᴠɴ
  │•🗳️ ᴇʟɪᴍɪɴᴀʀᴠɪᴅᴇᴏ
  │•🗳️ ᴇʟɪᴍɪɴᴀʀᴀᴜᴅɪᴏ
  │•🗳️ ᴇʟɪᴍɪɴᴀʀɪᴍɢ
  │•🗳️ ᴇʟɪᴍɪɴᴀʀsᴛɪᴄᴋᴇʀ
  ┗━━━━━━━━━━━━━━━━━━━━┛`.trim();
    if (m.isGroup) {
      conn.sendMessage(m.chat, {image: pp, caption: str.trim(), mentions: [...str.matchAll(/@([0-9]{5,16}|0)/g)].map((v) => v[1] + '@s.whatsapp.net')}, {quoted: m});
    } else {
      const fkontak2 = {'key': {'participants': '0@s.whatsapp.net', 'remoteJid': 'status@broadcast', 'fromMe': false, 'id': 'Halo'}, 'message': {'contactMessage': {'vcard': `BEGIN:VCARD\nVERSION:3.0\nN:Sy;Bot;;;\nFN:y\nitem1.TEL;waid=${m.sender.split('@')[0]}:${m.sender.split('@')[0]}\nitem1.X-ABLabel:Ponsel\nEND:VCARD`}}, 'participant': '0@s.whatsapp.net'};
      conn.sendMessage(m.chat, {image: pp, caption: str.trim(), mentions: [...str.matchAll(/@([0-9]{5,16}|0)/g)].map((v) => v[1] + '@s.whatsapp.net')}, {quoted: fkontak2});
    }
    // conn.sendButton(m.chat, str, wm, pp, [['𝙼𝙴𝙽𝚄 𝙿𝚁𝙸𝙽𝙲𝙸𝙿𝙰𝙻', '/menu']], m, { mentions: [m.sender] })
  }
};
handler.help = ['cajafuerte'];
handler.tags = ['owner'];
handler.command = /^(cajafuerte)$/i;
handler.rowner = true;
handler.fail = null;
export default handler;
